[
  {
    "timestamp": "2025-12-29T11:50:39.413917",
    "text": "We are once again testing the functionality of this software. Test test Pickles Bananas Fart Cucumber.",
    "duration": 7.65,
    "words": 16,
    "chars": 102
  },
  {
    "timestamp": "2025-12-29T11:48:02.822488",
    "text": "We are once again testing whether this software is functional whatsoever.",
    "duration": 8.26,
    "words": 11,
    "chars": 73
  },
  {
    "timestamp": "2025-12-29T11:45:10.321803",
    "text": "!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "duration": 9.31,
    "words": 1,
    "chars": 224
  },
  {
    "timestamp": "2025-12-29T10:00:05.422150",
    "text": "Can you put in how long it takes to actually? Output It says total time took 14 seconds, but still that's almost a one-to-one second of audio to second of Transcription rate which is terrible. You know if I talk for a minute long. I have to wait a full minute before you Or yeah, you get my words",
    "duration": 20.69,
    "words": 59,
    "chars": 296
  },
  {
    "timestamp": "2025-12-29T09:59:01.188573",
    "text": "I just don't expect this to work that well. I mean, it's just been continuous issue after issue after issue You know a 10-second recording we're starting to get to the point where it takes longer to transcribe than it does to record it I can talk in a hundred and fifty seven words per minute, but I can only type it 30 words per minute So we need to resolve this",
    "duration": 16.93,
    "words": 72,
    "chars": 363
  },
  {
    "timestamp": "2025-12-29T09:01:19.028287",
    "text": "!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "duration": 9.23,
    "words": 1,
    "chars": 224
  },
  {
    "timestamp": "2025-12-28T17:33:58.991322",
    "text": "Okay, another maybe minor issue. I can't exit the app via,nd line. If I press Control C, it breaks. And then I can't exit. I've tried Control Z, Control X, Control C, Escape. I tried it all. I have to actually close out of the window.",
    "duration": 17.0,
    "words": 46,
    "chars": 234
  },
  {
    "timestamp": "2025-12-28T17:30:35.558797",
    "text": "Are you 100% sure about that? Because whisper typing the app, when I use it, it's instant. I could talk for a minute and a half, press the button, and it instantly pastes all my audio. Maybe with like a second of delay.",
    "duration": 15.04,
    "words": 43,
    "chars": 219
  },
  {
    "timestamp": "2025-12-28T17:28:56.563175",
    "text": "Is it possible for us to stream the audio to the agent so we don't have to like bundle it and then have it be processed?",
    "duration": 7.1,
    "words": 26,
    "chars": 120
  },
  {
    "timestamp": "2025-12-28T17:28:30.995754",
    "text": "Okay, this is a reasonable test that I'm gonna do while I'm listening to music in the garage The placement looks a little bit better. The icon looks super grainy and shitty. So maybe we can fix that But yeah, it is working",
    "duration": 16.45,
    "words": 43,
    "chars": 222
  },
  {
    "timestamp": "2025-12-28T17:14:58.370363",
    "text": "Okay, it seems like it's working better now. It does need a little bit more space because right now it's smushed off of the screen. But I think that's, you know, not a huge problem as of right now. I am glad that it's working though.",
    "duration": 16.36,
    "words": 46,
    "chars": 233
  },
  {
    "timestamp": "2025-12-28T16:51:39.435192",
    "text": "Are we already using the current model as efficiently as possible? Like, are we only doing single threading? Like, is there any kind of efficiency that we can do to try to make the most accurate model the fastest? Not the fastest, but faster.",
    "duration": 14.51,
    "words": 44,
    "chars": 242
  },
  {
    "timestamp": "2025-12-28T16:49:54.657972",
    "text": "That chain of text above took 25 seconds to generate as well.",
    "duration": 4.26,
    "words": 12,
    "chars": 61
  },
  {
    "timestamp": "2025-12-28T16:49:28.208270",
    "text": "would say there is no aesthetic it's just a dot in the corner of the screen I don't hate it but I do wish it had a little more substance right now it's just like a red dot with a ring around it with a little white speck on it",
    "duration": 14.94,
    "words": 50,
    "chars": 225
  },
  {
    "timestamp": "2025-12-28T16:48:17.401553",
    "text": "i am trying to test if this transcription system works or not",
    "duration": 7.08,
    "words": 12,
    "chars": 61
  }
]